#+title:      A Klasse 2020-24
#+date:       [2022-12-28 Mi 20:45]
#+filetags:   :4a:Project:
#+identifier: 20221228T204513
#+STARTUP: showall
#+STARTUP: logdone
#+STARTUP: lognotedone
#+CATEGORY: golling
#+LANGUAGE: de
#+BIBLIOGRAPHY: ~/RoamNotes/references/Literatur.bib
#+SETUPFILE: ~/RoamNotes/config/latex_setup.org
#+ATTR_LATEX: :environment tabularx :placement [h] :center t :width \linewidth
#+OPTIONS: toc:nil
#+export_file_name: ~/RoamNotes/exports/4a.html
#+AUTHOR: Matthias Fuchs
#+EMAIL: matthiasfuchs01@gmail.com

* 4A [KV Magdalena Pürrer]

#+Name: 2021-students
| First      | Last        | Name                  | Note | Mitarbeit | Heft | PPP |
|------------+-------------+-----------------------+------+-----------+------+-----|
| Stefan     | Gonschorek  | [[Stefan Gonschorek][Stefan Gonschorek]]     |    1 |         1 |    1 |   1 |
| Manuel     | Irrnberger  | [[Manuel Irrnberger][Manuel Irrnberger]]     |    1 |         1 |    1 |   1 |
| Tobias     | Kappel      | [[Tobias Kappel][Tobias Kappel]]         |    1 |         1 |    1 |   1 |
| Luis       | Korten      | [[Luis Korten][Luis Korten]]           |    3 |         3 |    3 |   4 |
| Adrian     | Lamprecht   | [[Adrian Lamprecht][Adrian Lamprecht]]      |    4 |         4 |    3 |   4 |
| Noah       | Linhuber    | [[Noah Linhuber][Noah Linhuber]]         |    1 |         1 |    1 |   1 |
| Hanna      | Maier       | [[Hanna Maier][Hanna Maier]]           |    1 |         1 |    1 |   1 |
| Melissa    | Neudorfer   | [[Melissa Neudorfer][Melissa Neudorfer]]     |    1 |         1 |    1 |   1 |
| Arthur     | Schattauer  | [[Arthur Schattauer][Arthur Schattauer]]     |    2 |         1 |    1 |   3 |
| Fabian     | Schober     | [[Fabian Schober][Fabian Schober]]        |    1 |         1 |    1 |   1 |
| Kristina   | Seidl       | [[Kristina Seidl][Kristina Seidl]]        |    1 |         1 |    1 |   1 |
| Anna       | Steiner     | [[Anna Steiner][Anna Steiner]]          |    1 |         1 |    1 |   1 |
| Andre-Leon | Stippler    | [[Andre-Leon Stippler][Andre-Leon Stippler]]   |    1 |         1 |    1 |   1 |
| Nico       | Straßer     | [[Nico Straßer][Nico Straßer]]          |    3 |         3 |    3 |   4 |
| Emma       | Sunkler     | [[Emma Sunkler][Emma Sunkler]]          |    1 |         1 |    1 |   1 |
| Christina  | Unterrainer | [[Christina Unterrainer][Christina Unterrainer]] |    1 |         1 |    1 |   1 |
| Thomas     | Wenger      | [[Thomas Wenger][Thomas Wenger]]         |    1 |         1 |    1 |   1 |
| Lena       | Zorzi       | [[Lena Zorzi][Lena Zorzi]]            |    1 |         1 |    1 |   1 |
#+TBLFM: $4=vmean($5..$>);%.0f
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $5='(identity remote(Mitarbeit,@@#$2))
#+TBLFM: $7='(identity remote(2021-presentation-marks,@@#$2))

#+BEGIN_SRC python :var table=2021-students :results output raw
  print('* Mitarbeit')
  for student in table:
      first = student[0]
      last = student[1]
      email = first + '.' + last + '@golling.schule'
      print('** ' + first + ' ' + last + '')
      print(':PROPERTIES:')
      print(':EMAIL: ' '[[mailto: ' + first + ' ' + last + ' <' + email + '>]]')
      print(':EXPORT_FILE_NAME: ' '~/RoamNotes/exports/'  + first +  '_'  + last +  '.html')
      print(':ID: ' + first + '' + last + '')
      print(':END: ')
      print('#+Name: ' + first + '' + last + '')
      print('|-------+-------+------+---------|')
      print('| Datum | Topic | Note | Notizen |')
      print('|-------+-------+------+---------|')
      print('\n')
      print('*** Note ' + first + ' ' + last + '')
      print('#+Name: Note_' + first + '' + last + '')
      print('|-----------+-------------+-----+-----------+------------|')
      print('| Mitarbeit | Heft / Buch | LZK | Sonstiges | Gesamtnote |')
      print('|-----------+-------------+-----+-----------+------------|')
      print('|         2 |           3 |   2 |         3 |        2.5 |')
      print('#+TBLFM: $5=vmean($1..$4)')
      print('\n')
#+END_SRC

#+RESULTS:
* Mitarbeittabelle
# In diese Tabelle trage ich die Mitarbeit während 10 Schulwochen ein. Danach kann ich mit der ersten Tabellenformel die aktuelle Durchschnittsnote errechnen. Diese kann ich in die obige Tabelle übernehmen. Nach 23 Wochen (dh einem Semster) müsste ich die Tabelle wieder leeren - hm, gibt es keine bessere Lösung? Eine Tabelle mit allen 43 Schulwochen wäre zu groß. Mit 'C-c TAB' kann ich einzelne Spalten ein- und ausklappen. Wie geht das mit mehreren Spalten?
#+Name: Mitarbeit
| Name                  | Note | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 |
|-----------------------+------+---+---+---+---+---+---+---+---+---+----|
| [[Stefan Gonschorek][Stefan Gonschorek]]     | 1    |   |   |   |   |   |   |   |   |   |    |
| [[Manuel Irrnberger][Manuel Irrnberger]]     | 1    |   |   |   |   |   |   |   |   |   |    |
| [[Tobias Kappel][Tobias Kappel]]         | 1    |   |   |   |   |   |   |   |   |   |    |
| [[Luis Korten][Luis Korten]]           | 3    |   |   |   |   |   |   |   |   |   |    |
| [[Adrian Lamprecht][Adrian Lamprecht]]      | 4    |   |   |   |   |   |   |   |   |   |    |
| [[Noah Linhuber][Noah Linhuber]]         | 1    |   |   |   |   |   |   |   |   |   |    |
| [[Hanna Maier][Hanna Maier]]           | 1    |   |   |   |   |   |   |   |   |   |    |
| [[Melissa Neudorfer][Melissa Neudorfer]]     | 1    |   |   |   |   |   |   |   |   |   |    |
| [[Arthur Schattauer][Arthur Schattauer]]     | 1    |   |   |   |   |   |   |   |   |   |    |
| [[Fabian Schober][Fabian Schober]]        | 1    |   |   |   |   |   |   |   |   |   |    |
| [[Kristina Seidl][Kristina Seidl]]        | 1    |   |   |   |   |   |   |   |   |   |    |
| [[Anna Steiner][Anna Steiner]]          | 1    |   |   |   |   |   |   |   |   |   |    |
| [[Andre-Leon Stippler][Andre-Leon Stippler]]   | 1    |   |   |   |   |   |   |   |   |   |    |
| [[Nico Straßer][Nico Straßer]]          | 3    |   |   |   |   |   |   |   |   |   |    |
| [[Emma Sunkler][Emma Sunkler]]          | 1    |   |   |   |   |   |   |   |   |   |    |
| [[Christina Unterrainer][Christina Unterrainer]] | 1    |   |   |   |   |   |   |   |   |   |    |
| [[Thomas Wenger][Thomas Wenger]]         | 1    |   |   |   |   |   |   |   |   |   |    |
| [[Lena Zorzi][Lena Zorzi]]            | 1    |   |   |   |   |   |   |   |   |   |    |
#+TBLFM: $1='(identity remote(2021-students,@@#$3))
#+TBLFM: $2=vmean($3..$>);%.0f

* PPP
#+Name: 2021-presentation-marks
| Name                  | Notes | Presentation          | Percentage | Reason |
|-----------------------+-------+-----------------------+------------+--------|
| [[Stefan Gonschorek][Stefan Gonschorek]]     |     2 | Jesaja                |            |        |
| [[Manuel Irrnberger][Manuel Irrnberger]]     |     2 | Jesaja                |            |        |
| [[Tobias Kappel][Tobias Kappel]]         |     1 | Jeremia               |            |        |
| [[Luis Korten][Luis Korten]]           |     3 | Nathan (nicht fetig)  |            |        |
| [[Adrian Lamprecht][Adrian Lamprecht]]      |     5 | (fehlt)               |            |        |
| [[Noah Linhuber][Noah Linhuber]]         |     1 | Jeremia               |            |        |
| [[Hanna Maier][Hanna Maier]]           |     2 | Mirjam                |            |        |
| [[Melissa Neudorfer][Melissa Neudorfer]]     |     2 | Mirjam                |            |        |
| [[Arthur Schattauer][Arthur Schattauer]]     |     1 | Nathan                |            |        |
| [[Fabian Schober][Fabian Schober]]        |     1 | Jeremia               |            |        |
| [[Kristina Seidl][Kristina Seidl]]        |     2 | Jona                  |            |        |
| [[Anna Steiner][Anna Steiner]]          |     2 | Mirjam                |            |        |
| [[Andre-Leon Stippler][Andre-Leon Stippler]]   |     2 | Amos                  |            |        |
| [[Nico Straßer][Nico Straßer]]          |     3 | Nathan (nicht fertig) |            |        |
| [[Emma Sunkler][Emma Sunkler]]          |     2 | Jona                  |            |        |
| [[Christina Unterrainer][Christina Unterrainer]] |     2 | Jona                  |            |        |
| [[Thomas Wenger][Thomas Wenger]]         |     2 | Jesaja                |            |        |
| [[Lena Zorzi][Lena Zorzi]]            |     2 | Amos                  |            |        |
#+TBLFM: $1='(identity remote(2021-students,@@#$3))

